export default [
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d234",
                "name": "1: Посмотрите [видео](https://www.youtube.com/embed/hNy53MBpkkU). Перепишите примеры кодов счётчика. Ответьте на вопросы и задания ниже:",
                "nameData": {
                    "emoji": {}
                },
                "pos": 17154,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d236",
                "name": "1.1: Напишите код с применением языка [plantUML](https://real-world-plantuml.com/?type=activity) и добавьте сам код и картинку диаграммы data flow описания жизненных циклов Redux и Mobx в комментарии карточки.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 25763,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d237",
                "name": "1.2: Приведите в истории комментариев сравнительный анализ кодов счётчика написанных с применением Redux и Mobx.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 33136,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d238",
                "name": "1.3: Для каких проектов рекомендуется использовать Redux, а для каких Mobx?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 33754,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d240",
                "name": "1.4: Приведите список плюсов и минусов Redux VS Mobx?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 34063,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d235",
                "name": "2: Посмотрите видео https://www.youtube.com/embed/Yqz4rA85o68  и написать ТЗ (техническое задание по которому можно самостоятельно написать пример) на разобранный пример. Напишите разобранный пример на сайте https://stackblitz.com/ по вашему ТЗ и добавьте ссылку в историю карточки. Ответьте на вопросы ниже:",
                "nameData": {
                    "emoji": {}
                },
                "pos": 34372,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d239",
                "name": "2.1: Что такое и какие задачи расширение [MobX Developer Tools](https://chrome.google.com/webstore/detail/mobx-developer-tools/pfgnfdagidkfgccljigdamigbcnndkod) помогает решать?",
                "nameData": null,
                "pos": 51405,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23a",
                "name": "2.2: Как используется библиотека [mobx-react-devtools](https://www.npmjs.com/package/mobx-react-devtools)?",
                "nameData": null,
                "pos": 68679,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23b",
                "name": "2.3: Для чего нужна библиотека [mobx-react](https://www.npmjs.com/package/mobx-react)?",
                "nameData": null,
                "pos": 85247,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23c",
                "name": "2.4: Объясните как вы понимаете использование синтаксиса декоратора своими словами. Для чего нужен [@babel/plugin-proposal-decorators](https://babeljs.io/docs/en/babel-plugin-proposal-decorators)? Какие задачи помогает решать [включение декоратора в mobx](https://mobx.js.org/enabling-decorators.html#enabling-decorators-)?",
                "nameData": null,
                "pos": 102561,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23d",
                "name": "2.5: Какой апи используется в примере https://www.youtube.com/embed/Yqz4rA85o68 ? Для чего он применяется в примере?",
                "nameData": null,
                "pos": 119011,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23e",
                "name": "2.6: Что такое конфигурация? Какие возможности предоставляет использование [configure из библиотеки mobx](https://mobx.js.org/configuration.html)?",
                "nameData": null,
                "pos": 135598,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d23f",
                "name": "2.7: Что такое побочные эфекты (side effects)? Какие есть побочные эффекты в mobx? [Как запускать side effects](https://mobx.js.org/reactions.html#running-side-effects-with-reactions-) из библиотеки mobx?",
                "nameData": null,
                "pos": 152753,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d243",
                "name": "2.8: Как создаётся [состояние](https://mobx.js.org/observable-state.html#creating-observable-state) в Mobx? В чём отличия makeAutoObservable(target, overrides?, options?) и makeObservable(target, annotations?, options?)? ",
                "nameData": {
                    "emoji": {}
                },
                "pos": 161206.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d244",
                "name": "2.9: Для чего нужно [observable](https://mobx.js.org/observable-state.html#observable) и как работает наблюдение за объектом?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 165433.25,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d245",
                "name": "2.10: Перечислите списки [аннотаций](https://mobx.js.org/observable-state.html#available-annotations), [ограничений](https://mobx.js.org/observable-state.html#limitations) и [опций](https://mobx.js.org/observable-state.html#options-) с описанием применения.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 167546.625,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d241",
                "name": "3: EN Посмотрите видео https://www.youtube.com/embed/2ejs-uxSbAk и напишите ТЗ к разобранному примеру. Написать решение по собственному ТЗ и добавьте в комментарии ссылку на проект на сайте https://stackblitz.com/ в историю карточки. Ответьте на вопросы ниже:",
                "nameData": {
                    "emoji": {}
                },
                "pos": 169660,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6158609d96d4a65199a2d1e7",
                "state": "incomplete",
                "id": "6158609d96d4a65199a2d242",
                "name": "3.1: Объясните как использовать MobX для управления состоянием в react с использованием хуков?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 186801,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "615860fc97affc050e4cdc18",
                "state": "incomplete",
                "id": "615860fd97affc050e4cdc73",
                "name": "1: Добавить в свой итоговый проект меню \"Мои проекты на курсе\". Перечислить в рамках страницы \"Мои проекты на курсе\" все темы уроков и в каждом уроке добавить список всех домашних заданий и ссылки на проделанные задачи.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 50083,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "615860fc97affc050e4cdc18",
                "state": "incomplete",
                "id": "615860fd97affc050e4cdc74",
                "name": "2: Добавить в свой итоговый проект меню \"Материалы\". Перечислить в рамках страницы Темы уроков и в каждой теме: Список всех видеоуроков для домашних работ и Список всех ссылок которые предложены для домашних работ во вложении и комментариях",
                "nameData": {
                    "emoji": {}
                },
                "pos": 67168,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "615860fc97affc050e4cdc18",
                "state": "incomplete",
                "id": "615860fd97affc050e4cdc75",
                "name": "3: Добавить в свой итоговый проект меню \"Обратная связь о курсе\". Написать отзыв как вам понравился курс.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 83554,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "615860fc97affc050e4cdc18",
                "state": "incomplete",
                "id": "615860fd97affc050e4cdc72",
                "name": "4: Посмотрите https://www.youtube.com/embed/Ex2j4oIweDk. Перепишите пример и добавьте в комментариях ссылку на https://stackblitz.com/.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 116322,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "615860fc97affc050e4cdc18",
                "state": "incomplete",
                "id": "615860fd97affc050e4cdc71",
                "name": "5*: Посмотрите список из 12 видеоуроков  https://www.youtube.com/embed/v4pycbXkP1Y?list=PLNkWIWHIRwMEsMUc0B-lYb7DTLroWlKLK. Перепишите примеры из видео занятий и приложите в комментариях ссылку на https://stackblitz.com/.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 149090,
                "due": null,
                "idMember": null
            },

            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4e8",
                "name": "Задание 1: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе? https://www.youtube.com/embed/IXXO2-xnI8U",
                "nameData": null,
                "pos": 16459,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4ee",
                "name": "Задание 1: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе? https://www.youtube.com/embed/rlTvbjScIKA",
                "nameData": null,
                "pos": 24718.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4e9",
                "name": "Задание 2: Создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложение часы из примера в задании 1 с изменением раз в 30 секунд.",
                "nameData": null,
                "pos": 32978,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4ea",
                "name": "Задание 3: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?https://www.youtube.com/embed/kv-T62uFJZg",
                "nameData": null,
                "pos": 49720,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4eb",
                "name": "Задание 4: Создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложением блога из примера в задании 2. Тема новостей своя (путешествие, машины и тп.).",
                "nameData": null,
                "pos": 66137,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4ec",
                "name": "Задание 5: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?https://www.youtube.com/embed/-z-OAVigStA",
                "nameData": null,
                "pos": 82985,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a93fc3354858e3462d4c7",
                "state": "complete",
                "id": "612a93fd3354858e3462d4ed",
                "name": "Задание 6: Посмотрев пример в задании 5 создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложение должно отображать только одну статью по выбору из списка (в качестве альтернативы может быть выбор другой тематики например бенефит услуг ДМС: 🦷 зубы, 👀 глаза, сосуды, амбулаторное лечение и тп. по выбору отображается список услуг и клиник)",
                "nameData": null,
                "pos": 100379,
                "due": null,
                "idMember": null
            },

            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025f8",
                "name": "Задание 1: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?  Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/Q7FkSWMf2Qo",
                "nameData": null,
                "pos": 16406,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025f9",
                "name": "Задание 2 Посмотреть и кратко описать в карточке сюжет видео ролика. Кто читал видео (кампания, лектор)? Добавьте ссылку на github профиля лектора. Перепишите пример с видео и добавьте ссылку в комментариях.  https://www.youtube.com/embed/yzxE3M_xx3w",
                "nameData": null,
                "pos": 33646,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025fa",
                "name": "Задание 3: Посмотреть и кратко описать в карточке о чём это видео. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/qqeKBHnRR6A",
                "nameData": null,
                "pos": 50816,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025fb",
                "name": "Задание 4: Посмотреть и кратко описать в карточке о чём это видео. https://www.youtube.com/embed/7JNz14uTMTE",
                "nameData": null,
                "pos": 68124,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025fc",
                "name": "Задание 5: Посмотреть и кратко описать в карточке о чём это видео. Перепишите пример и добавьте ссылку в комментариях. Пусть в стейте хранится массив с характеристиками самоката. У каждого самоката есть наименование, остаток заряда и стоимость в час. Выведите все самокаты на экран с помощью цикла. Сделайте так, чтобы отображением самоката на экран занимался отдельный компонент. https://www.youtube.com/embed/isrKkL_54Eo",
                "nameData": null,
                "pos": 85245,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025fd",
                "name": "Задание 6: Дан массив с работниками. У каждого работника есть имя, фамилия, количество отработанных дней и зарплатная ставка за день. Выведите этих работников на экран в виде таблицы. Сделайте так, чтобы в последней колонке автоматически рассчитывалась зарплата работника (количество отработанных дней умножить на ставку). Сделайте так, чтобы количество дней и ставка выводились в виде инпутов. Если поредактировать эти инпуты - зарплата также должна поменяться. Под таблицей также выведите суммарную зарплату всех работников.",
                "nameData": null,
                "pos": 102113,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025fe",
                "name": "Задание 7: Дан следующий стейт: this.state = {show: true, name: 'Иван'}; Изначально результат работы метода render следующий ('Иван' берется из this.state.name): <div><p>Привет, Иван!</p></div> Сделайте так, чтобы если this.state.show был равен true, то выводился текст 'Привет, Иван', а если равен false - то 'Пока, Иван'",
                "nameData": null,
                "pos": 119324,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef97025ff",
                "name": "Задание 8: Дан массив языков ['html', 'css', 'js', 'php']. Выведите эти языки в виде списка <ul>.",
                "nameData": null,
                "pos": 136583,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef9702600",
                "name": "Задание 9: Дан массив с числами. Выведите эти числа каждое в своем <span> так, чтобы на выводе к каждому числу прибавлялось число 3.",
                "nameData": null,
                "pos": 153566,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "612a95809677848ef97025ec",
                "state": "complete",
                "id": "612a95809677848ef9702601",
                "name": "Задание 10: Реализуйте игру крестики-нолики. Играют два игрока, каждый ходит по очереди.",
                "nameData": null,
                "pos": 170963,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca55",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hQRPsKzpo34",
                "nameData": null,
                "pos": 16774,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca56",
                "name": "2: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hwPo6OLBbD8",
                "nameData": null,
                "pos": 34155,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca57",
                "name": "3: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/QPEB3ZQLTZY",
                "nameData": {
                    "emoji": {}
                },
                "pos": 51107,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca58",
                "name": "4: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/rUGDM7MaRvk",
                "nameData": {
                    "emoji": {}
                },
                "pos": 67591,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5a",
                "name": "5: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/slaaDOt0ZvM",
                "nameData": {
                    "emoji": {}
                },
                "pos": 75989,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca59",
                "name": "6: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/8Yy6MDsF-Tg",
                "nameData": {
                    "emoji": {}
                },
                "pos": 84387,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5b",
                "name": "7: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/wPQlz4M4rnI",
                "nameData": {
                    "emoji": {}
                },
                "pos": 100936,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5c",
                "name": "8: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/X1Skt2n7y3U",
                "nameData": {
                    "emoji": {}
                },
                "pos": 117737,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5d",
                "name": "9: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ItUwRSXxwwk",
                "nameData": {
                    "emoji": {}
                },
                "pos": 134682,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5e",
                "name": "10: Что делает плагин \"eslint-plugin-react-hooks\"? Зачем нужен? Как настраивать?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 168447,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614ee3a9483e6922ff36c9eb",
                "state": "incomplete",
                "id": "614ee3aa483e6922ff36ca5f",
                "name": "11: EN Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ScT4ElKd6eo",
                "nameData": null,
                "pos": 184872,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b1",
                "name": "Задание 1: Изучить и кратко описать комментарием к карточке, что такое NPM.",
                "nameData": null,
                "pos": 16570,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67bc",
                "name": "Задание 1: Просмотреть рекомендованное видео: https://www.youtube.com/embed/sL6VvWOAuLE",
                "nameData": null,
                "pos": 8285,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b2",
                "name": "Задание 2: Изучить и кратко описать комментарием к карточке команду \"npm version\" 1. https://docs.npmjs.com/cli/version.html 2. Об изменении версии командой npm version. Привести примеры атрибутов изменяемых разрядов мажорной/минорной/патч версий https://blog.popstas.ru/blog/2020/04/15/npm-version/",
                "nameData": null,
                "pos": 33601,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b3",
                "name": "Задание 3: Изучить и кратко описать комментарием к карточке команду \"npm install\" https://docs.npmjs.com/cli/install.html",
                "nameData": null,
                "pos": 50126,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b4",
                "name": "Задание 4: Изучить и кратко описать комментарием к карточке команду \"npm uninstall\" https://docs.npmjs.com/cli/uninstall.html",
                "nameData": null,
                "pos": 67431,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b5",
                "name": "Задание 5: Изучить и кратко описать комментарием к карточке команду \"npm update\" https://docs.npmjs.com/cli/update.html",
                "nameData": null,
                "pos": 84297,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b6",
                "name": "Задание 6: Изучить и кратко описать комментарием к карточке команду \"npm run-script\" https://docs.npmjs.com/cli/run-script.html",
                "nameData": null,
                "pos": 101534,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b7",
                "name": "Задание 7: Изучить и кратко описать комментарием к карточке, что такое GitHub. Пока без углубления в Git.",
                "nameData": null,
                "pos": 118170,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b8",
                "name": "Задание 7: Просмотреть рекомендованное видео: https://www.youtube.com/playlist?list=PL7Nh93imVuXyiJKz6YrELUACjXWfAXlwW",
                "nameData": null,
                "pos": 114011,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67bd",
                "name": "Задание 7: Просмотреть рекомендованное видео: https://www.youtube.com/embed/JfpCicDUMKc",
                "nameData": null,
                "pos": 109852,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67ba",
                "name": "Задание 8 Разобраться как создавать новые проекты https://stackblitz.com/ и как им пользоваться для проектов GitHub.",
                "nameData": null,
                "pos": 169120,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67be",
                "name": "Задание 8: Просмотреть рекомендованное видео: https://www.youtube.com/embed/RJoNVnFWxRs",
                "nameData": null,
                "pos": 143645,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67b9",
                "name": "Задание 9: Создать новый проект с файлом index.js на https://stackblitz.com со стандартным JS. Сделать описание ReadMe при помощи Маркдауна. Добавить [UML-схему сборки приложения](https://trello-attachments.s3.amazonaws.com/607a4f1910a1f27254381596/607a520b7cd92579e31ac9c6/cb276a837091193a7a8c20ac9ddceb61/image.png) на реакт (PlantUML), таблицу, картинку, сделать форматирование текста",
                "nameData": null,
                "pos": 186316.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67bf",
                "name": "Задание 10: Изучить и кратко описать комментарием к карточке, что делает команда: `npx create-react-app name-app`",
                "nameData": null,
                "pos": 194914.75,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61209cdd780b438a6a3a6722",
                "state": "complete",
                "id": "61209cde780b438a6a3a67bb",
                "name": "Задание 11: Создать новый React с использованием react UI library [Ant Design of React](https://ant.design/docs/react/getting-started) проект и изменить текст на странице как вам понравилось первое занятие? И что Вы хотели бы улучшить.",
                "nameData": null,
                "pos": 203513,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c4f",
                "name": "Задание 1: Изучить видео и кратко описать комментарием к карточке, что такое JSX: https://www.youtube.com/embed/v8q0e0bqJXk https://ru.reactjs.org/docs/introducing-jsx.html https://metanit.com/web/react/1.3.php",
                "nameData": null,
                "pos": 8214.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c4e",
                "name": "Задание 2: Создать новый проект с использованием react.js. Cоздать стандартную разметку HTML5.0. Добавить div с ИД. И создать приложение с использованием ReactDOM",
                "nameData": null,
                "pos": 16429,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c50",
                "name": "Задание 3: Создать новый проект с использованием react.js. Cоздать стандартную разметку HTML5.0. Добавить div с ИД. И создать приложение с использованием ReactDOM. Приложение вычисляющее сумму первых N натуральных чисел. https://ru.reactjs.org/docs/hello-world.html [Сумма  n  первых натуральных чисел](http://www.math24.ru/%D0%BA%D0%BE%D0%BD%D0%B5%D1%87%D0%BD%D1%8B%D0%B5-%D1%87%D0%B8%D1%81%D0%BB%D0%BE%D0%B2%D1%8B%D0%B5-%D1%80%D1%8F%D0%B4%D1%8B.html)",
                "nameData": null,
                "pos": 33225,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c51",
                "name": "Задание 4: Изучить видео и кратко описать комментарием к карточке, что такое babel. И для чего используется: https://www.youtube.com/embed/VrayPysaeGY https://www.youtube.com/embed/WjxH7GODv6k",
                "nameData": null,
                "pos": 50253,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c52",
                "name": "Задание 4: Изучить видео и кратко описать комментарием к карточке, что такое webpack. И для чего он используется: https://www.youtube.com/embed/1nQlcb7E_eg",
                "nameData": null,
                "pos": 67483,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c53",
                "name": "Задание 5: Изучить видео и кратко описать комментарием к карточке, что за расширение React Developer Tools. И для чего оно используется: https://www.youtube.com/embed/K2DB3B9PU9Q https://www.youtube.com/embed/-LfSE9ZxZDI",
                "nameData": null,
                "pos": 84065,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6120f580571a96541c653c32",
                "state": "complete",
                "id": "6120f580571a96541c653c54",
                "name": "Задание 6: Создать новое приложение React https://www.youtube.com/embed/0grybmrgc2Q с использованием Material-UI library https://www.youtube.com/embed/GMfAgHcPSqc https://www.youtube.com/embed/RVSR2p6vxi0 проект и разместить на странице адаптивное меню",
                "nameData": null,
                "pos": 101174,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61504f21a99c5b60f42ce1da",
                "state": "incomplete",
                "id": "61504f22a99c5b60f42ce23d",
                "name": "1: Посмотреть цикл из 4-х видео уроков React и Redux [1. Что это за Redux и зачем он нужен.](https://www.youtube.com/embed/jvkhKRHS2TY) | [2. Подключаемся к Redux.](https://www.youtube.com/embed/wzWZDh0dUYE) | [3. Структура приложения, combineReducers, контейнеры.](https://www.youtube.com/embed/MahSyZSFQv8) | [4. Redux Saga, Генераторы, Redux Thunk.](https://www.youtube.com/embed/DG9rXV1kI0o) и написать технические требования к каждому из разобранных примеров. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. Ответить на вопросы что такое Генераторы, Redux Thunk и Redux Saga",
                "nameData": {
                    "emoji": {}
                },
                "pos": 12619.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61504f21a99c5b60f42ce1da",
                "state": "incomplete",
                "id": "61504f22a99c5b60f42ce23c",
                "name": "2: Посмотреть видео и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. https://www.youtube.com/embed/hpR-X2hTcqg",
                "nameData": {
                    "emoji": {}
                },
                "pos": 25239,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61504f21a99c5b60f42ce1da",
                "state": "incomplete",
                "id": "61504f22a99c5b60f42ce23b",
                "name": "3: Посмотреть видео и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. https://www.youtube.com/embed/dgM9OGVfKCQ",
                "nameData": {
                    "emoji": {}
                },
                "pos": 33873,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61504f21a99c5b60f42ce1da",
                "state": "incomplete",
                "id": "61504f22a99c5b60f42ce23a",
                "name": "4: Изучить материал статьи и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. [Redux: шаг за шагом](https://github.com/devSchacht/translations/tree/master/articles/tal-kol-redux-step-by-step-a-simple-and-robust-workflow-for-real-life-apps) Ответить на вопрос комментарием какие выводы вы сделали при изучении статьи?",
                "nameData": {
                    "emoji": {}
                },
                "pos": 99409,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e0e",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ty2ApOkMRws",
                "nameData": null,
                "pos": 16608,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e12",
                "name": "2: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/CHFD45QYtI8",
                "nameData": null,
                "pos": 41986.5,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e15",
                "name": "3: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/m_mtV4YaI8c",
                "nameData": null,
                "pos": 54675.75,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e0f",
                "name": "4: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/enpVbjOSLpQ",
                "nameData": null,
                "pos": 67365,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e10",
                "name": "5: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/i2NE0cbuQa4",
                "nameData": null,
                "pos": 84161,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e11",
                "name": "6: Посмотреть и кратко описать в карточке сюжет видео ролика и добавить в комментарии внешнюю ссылку с пользователями. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/auAtFC5nfTs",
                "nameData": null,
                "pos": 100966,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e13",
                "name": "7: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/bMApsb0FpFE",
                "nameData": null,
                "pos": 135213,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613300ae050d62301d886d89",
                "state": "complete",
                "id": "613300af050d62301d886e14",
                "name": "8: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/4xjWX3oRQoc",
                "nameData": null,
                "pos": 135213,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def4",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/l4tKCCGUeMo",
                "nameData": null,
                "pos": 17123,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def5",
                "name": "2: Посмотреть и своими словами описать что такое: Reducer, Actions, Action Creators, Store,  описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/WLVjYRBoDgU?list=PLqHlAwsJRxANFIgAf7BO8hNYdvipLERxQ",
                "nameData": null,
                "pos": 34078,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def6",
                "name": "3: изучить материал на странице и кратко пересказать для чего нужен хук useDebugValue(value) https://ru.reactjs.org/docs/hooks-reference.html#usedebugvalue",
                "nameData": {
                    "emoji": {}
                },
                "pos": 50667,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def7",
                "name": "4: Посмотреть и кратко пересказать в карточке для чего нужен хук `const [state, dispatch] = useReducer(reducer, initialArg, init);`. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/l4tKCCGUeMo",
                "nameData": null,
                "pos": 67965,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def8",
                "name": "5: Посмотреть и кратко пересказать в карточке для чего нужен хук `const memoizedCallback = useCallback(   () => {     doSomething(a, b);   },   [a, b], );`. объяснить на примере что такое [мемозолированный колбэк](https://vrogov-exceedteam.gitbook.io/react-hooks-redux/react/osnovy/khuk-kollbeka-usecallback). Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/F8EvdTsl6hU",
                "nameData": {
                    "emoji": {}
                },
                "pos": 85040,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84def9",
                "name": "6: Посмотреть и кратко пересказать в карточке для чего предназначен хук `const memoizedValue = useMemo(() => computeExpensiveValue(a, b), [a, b]);`. Объяснить [понятие хука](https://vrogov-exceedteam.gitbook.io/react-hooks-redux/react/chto-dalshe/khuk-memoizirovannogo-znacheniya-usememo) применение на примере. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/bm7wyCDJ7H8",
                "nameData": null,
                "pos": 102000,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84defa",
                "name": "7: Посмотреть видео и рассказать на примере как создавать и зачем нужны [кастомные хуки](https://vrogov-exceedteam.gitbook.io/react-hooks-redux/react/sozdanie-sobstvennykh-khukov): https://www.youtube.com/embed/BGKbJ2aXCog",
                "nameData": {
                    "emoji": {}
                },
                "pos": 118660,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "614f1f4d18b13b13fb84de57",
                "state": "incomplete",
                "id": "614f1f4e18b13b13fb84defb",
                "name": "8*: EN: Посмотреть видео и рассказать на примере чем отличается МVC от FLUX https://www.youtube.com/embed/p8tqhf5qKOI",
                "nameData": {
                    "emoji": {}
                },
                "pos": 136014,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61330e5ef4fb9674a9c2fac4",
                "state": "complete",
                "id": "61330e5ef4fb9674a9c2fad1",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/RfHw3oQRbgg",
                "nameData": null,
                "pos": 16774,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61330e5ef4fb9674a9c2fac4",
                "state": "complete",
                "id": "61330e5ef4fb9674a9c2fad2",
                "name": "2: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hZcKg7c7lbQ",
                "nameData": null,
                "pos": 33828,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "61330e5ef4fb9674a9c2fac4",
                "state": "complete",
                "id": "61330e5ef4fb9674a9c2fad3",
                "name": "3: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hzB0CvJANn8",
                "nameData": null,
                "pos": 50675,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c802be383b80408691744",
                "state": "complete",
                "id": "613c802be383b8040869174d",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/LeysYaa8iW4",
                "nameData": null,
                "pos": 16572,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c802be383b80408691744",
                "state": "complete",
                "id": "613c802be383b8040869174e",
                "name": "2. Выполнить задание \"Список задач\" Пусть в стейте дан массив: ['тестовое задание 1']. Выведите каждый элемент этого массива в отдельной <li> в списке ul.  Под списком кнопка, по нажатию на которую в конец списка будет добавляться элемент с текстом 'из поля ввода'. Добавьте кнопочку, по нажатию на которую каждый раз будет исчезать последняя li из списка (каждый раз по одной, пока li в списке не закончатся). Рядом с каждым именем добавить кнопочку, по нажатию на которую li с этим именем будет зачёркиваться запись.  Ссылку на пример добавить в комментарии.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 33207,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "complete",
                "id": "613c80e9e289ec24f7c3ee82",
                "name": "1: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/dENUw979QiY",
                "nameData": null,
                "pos": 17358,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "complete",
                "id": "613c80e9e289ec24f7c3ee83",
                "name": "2: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/qdaDgC_xU0w",
                "nameData": {
                    "emoji": {}
                },
                "pos": 33943,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "complete",
                "id": "613c80e9e289ec24f7c3ee84",
                "name": "3: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/a2DkRBnp4ns",
                "nameData": null,
                "pos": 51165,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "complete",
                "id": "613c80e9e289ec24f7c3ee85",
                "name": "4: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/niRuU0RbYgI",
                "nameData": null,
                "pos": 68556,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "complete",
                "id": "613c80e9e289ec24f7c3ee86",
                "name": "5: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/j3MkFO0pUVo",
                "nameData": null,
                "pos": 85341,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "incomplete",
                "id": "613c80e9e289ec24f7c3ee87",
                "name": "6: JS! Посмотреть и кратко описать в карточке плюсы и минусы. Привести СВОЙ пример сравнения и добавьте ссылку в комментариях. https://www.youtube.com/embed/v6AVfIupNB8",
                "nameData": {
                    "emoji": {}
                },
                "pos": 101820,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "613c80e8e289ec24f7c3ee71",
                "state": "incomplete",
                "id": "613c80e9e289ec24f7c3ee88",
                "name": "7: Выполнить задание и добавьте ссылку в комментариях. Полицейский радар скорости, который сообщает о том, превышена ли скорость или нет.",
                "nameData": {
                    "emoji": {}
                },
                "pos": 118413,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d2d",
                "name": "1: Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/5X5ZLWdAnt4",
                "nameData": null,
                "pos": 16848,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d2e",
                "name": "2: Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/z7rhAp56Xvw",
                "nameData": null,
                "pos": 33594,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d30",
                "name": "3: EN Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/aHv_3g2Fw8A",
                "nameData": {
                    "emoji": {}
                },
                "pos": 41852,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d2f",
                "name": "4: EN Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/KaoyIX-X69g",
                "nameData": {
                    "emoji": {}
                },
                "pos": 50110,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d31",
                "name": "5: Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/Vok-FQDjoiM",
                "nameData": null,
                "pos": 66638,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "incomplete",
                "id": "6145d370fc3a143559556d35",
                "name": "6: Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/yYq0rWESsNY",
                "nameData": {
                    "emoji": {}
                },
                "pos": 75336,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "complete",
                "id": "6145d370fc3a143559556d32",
                "name": "7: Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Ссылки меняют только URL, а не фактический компонент, отображаемый на странице что можно сделать?**",
                "nameData": {
                    "emoji": {}
                },
                "pos": 84034,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "incomplete",
                "id": "6145d370fc3a143559556d33",
                "name": "8: Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Что такое блокировка переходов в истории api для React Router?**",
                "nameData": {
                    "emoji": {}
                },
                "pos": 101234,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "incomplete",
                "id": "6145d370fc3a143559556d34",
                "name": "9: Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Приведите пример как получить параметры запроса и параметры контекстов в react-router-dom.**",
                "nameData": {
                    "emoji": {}
                },
                "pos": 118535,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d370fc3a143559556cea",
                "state": "incomplete",
                "id": "6145d370fc3a143559556d36",
                "name": "10: Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Что такое window.performance.navigation.type и как после F5 загрузить нужную страницу?**",
                "nameData": {
                    "emoji": {}
                },
                "pos": 135175,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039bb",
                "name": "1: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com. https://www.youtube.com/embed/Q_UvAaKSK90",
                "nameData": {
                    "emoji": {}
                },
                "pos": 16494,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039bc",
                "name": "2: [Изучить понятие контекста](https://ru.reactjs.org/docs/context.html) и дать своё определение терминам: React.createContext; Context.Provider;Class.contextType; Context.Consumer; Context.displayName",
                "nameData": {
                    "emoji": {}
                },
                "pos": 32950,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039bd",
                "name": "3: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/6OoMglkreKs",
                "nameData": {
                    "emoji": {}
                },
                "pos": 50007,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039be",
                "name": "4: Изучить понятие [Refs](https://ru.reactjs.org/docs/refs-and-the-dom.html) и дать определение термину: React.createRef",
                "nameData": {
                    "emoji": {}
                },
                "pos": 66819,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039c0",
                "name": "5: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/RLWniwmfdq4",
                "nameData": {
                    "emoji": {}
                },
                "pos": 100568,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039bf",
                "name": "6: Изучить понятие [перенаправления refs](https://ru.reactjs.org/docs/forwarding-refs.html) и дать определение термину: React.forwardRef",
                "nameData": {
                    "emoji": {}
                },
                "pos": 166104,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039c1",
                "name": "7: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/mLwsIPBDr8A",
                "nameData": null,
                "pos": 182993,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039c2",
                "name": "8: Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?  Перепишите пример с видео в вашем новом приложении на stackblitz.com и добавьте картинку запущенного решения с ссылкой в комментариях. https://www.youtube.com/embed/LIkIM5u1mCk",
                "nameData": {
                    "emoji": {}
                },
                "pos": 199496,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039c3",
                "name": "9: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения. https://www.youtube.com/embed/Tln-wtsp8do",
                "nameData": {
                    "emoji": {}
                },
                "pos": 216190,
                "due": null,
                "idMember": null
            },
            {
                "idChecklist": "6145d3efa16afd88e180395b",
                "state": "incomplete",
                "id": "6145d3efa16afd88e18039c4",
                "name": "10: Написать новое приложение и добавить код с картинкой и ссылкой на приложение из stackblitz.com. Требования к форме. Поля ввода: Фамилия, Имя, Отчество, Дата рождения, Телефон, E-mail. Добавить кнопку \"Отправить\". Функционал кнопки отправка данных по адресу POST: https://jsonplaceholder.typicode.com/posts Требования к запросу: по нажатию \"Отправить\" заблокировать изменение полей, после ответа с сервера поменять все поля ввода на текстовые поля. Валидация полей: Фамилия - \"Не более 50 символа\",Имя - \"Не более 31 символа\", Отчество - \"Не более 31 символа\", Дата рождения - в формате \"dd.MM.yyyy\", Телефон-\"Маска “+7(NNN) NNN NN NN”, где N – любая цифра\", E-mail - \"валидация email\". Все поля обязательны, кроме E-mail",
                "nameData": {
                    "emoji": {}
                },
                "pos": 232971,
                "due": null,
                "idMember": null
            }
]